{
  "name": "Enchanter",
  "price": 10,
  "max_level": 100,
  "color": "#663399",
  "icon_item": "minecraft:enchanted_book",
  "description": "Enchanting is a skill that allows you to enchant items with magical abilities. You can enchant items by placing them in an enchanting table and using experience levels to enchant them. You can also enchant items with an anvil, but this is much more expensive. You can also enchant items with an anvil, but this is much more expensive.",
  "is_default": true,
  "actions": [
    {
      "type": "jobsplus:on_enchant_item",
      "short_description": "Enchant level 1",
      "description": "As an Enchanter, you can earn job experience by enchanting items with level 1 enchantments. These enchantments are the easiest to create, requiring only one experience level and only one lapis lazuli. With each enchantment you make, you'll gain experience towards your Enchanter job.",
      "rewards": [
        {
          "type": "jobsplus:job_exp",
          "chance": 100,
          "min_exp": 30,
          "max_exp": 50
        }
      ],
      "conditions": [
        {
          "type": "jobsplus:exp_level",
          "exp_level": 1
        }
      ]
    },
    {
      "type": "jobsplus:on_enchant_item",
      "short_description": "Enchant level 2",
      "description": "Once you have enough experience levels, you can move on to level 2 enchantments as an Enchanter. These enchantments are more complex, requiring two experience levels and two lapis lazuli, but they also grant greater benefits to your enchanted items. Keep enchanting, and you'll become a skilled Enchanter in no time.",
      "rewards": [
        {
          "type": "jobsplus:job_exp",
          "chance": 100,
          "min_exp": 50,
          "max_exp": 70
        }
      ],
      "conditions": [
        {
          "type": "jobsplus:exp_level",
          "exp_level": 2
        }
      ]
    },
    {
      "type": "jobsplus:on_enchant_item",
      "short_description": "Enchant level 3",
      "description": "The most skilled Enchanters can create level 3 enchantments, the most powerful enchantments available. These enchantments require three levels of experience and three lapis lazuli, but the rewards are well worth it. Keep enchanting and leveling up your Enchanter job to become a master of enchantments.",
      "rewards": [
        {
          "type": "jobsplus:job_exp",
          "chance": 100,
          "min_exp": 70,
          "max_exp": 100
        }
      ],
      "conditions": [
        {
          "type": "jobsplus:exp_level",
          "exp_level": 3
        }
      ]
    }
  ],
  "powerups": []
}